* Corilla
#+BEGIN: clocktable :maxlevel 2 :scope subtree :tstart "<2017-03-01 Sun>"
#+CAPTION: Clock summary at [2017-03-19 Sun 19:05]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |
#+END:


Pandoc micro-service

Spoke with Natan Koch about the technical details.
David is the business side

They have a launch on the 21st of Nov.

** DONE for a response from David.
   CLOSED: [2016-11-13 Sun 23:54]
** DONE for a response from David.
   CLOSED: [2016-12-05 Mon 18:58]
** DONE Read contract
   CLOSED: [2016-12-05 Mon 21:26]


Problems with the contract:
- I don't have an ABN yet.
** DONE go by the commercial registrars office
   CLOSED: [2016-12-06 Tue 16:00]
** DONE for a response from my parents.
   CLOSED: [2016-12-06 Tue 16:00]
** DONE Preleminary work
   CLOSED: [2016-12-06 Tue 16:03]
   :LOGBOOK:
   CLOCK: [2016-12-06 Tue 16:00]--[2016-12-06 Tue 19:00] =>  3:00
   :END:
** DONE Contract admin
   CLOSED: [2016-12-06 Tue 16:03]
   :LOGBOOK:
   CLOCK: [2016-12-06 Tue 19:00]--[2016-12-06 Tue 21:00] =>  2:00
   :END:
** DONE for a response about where to host the repo.
   CLOSED: [2016-12-08 Thu 11:54]
** DONE Fork the Corilla repo
   CLOSED: [2016-12-08 Thu 18:57]
** DONE Go through the repo and the spec again to see whet else needs to be done.
   CLOSED: [2016-12-08 Thu 20:03]
   :LOGBOOK:
   CLOCK: [2016-12-08 Thu 19:45]--[2016-12-08 Thu 20:03] =>  0:18
   :END:
** DONE Allow for ePUB publishing
   CLOSED: [2016-12-09 Fri 11:06]
   :LOGBOOK:
   CLOCK: [2016-12-09 Fri 10:42]--[2016-12-09 Fri 11:05] =>  0:23
   :END:
** DONE for a response from Nathan
   CLOSED: [2016-12-09 Fri 11:15]
** DONE Confirm that downloading remote images works
   CLOSED: [2016-12-10 Sat 12:39]
   :LOGBOOK:
   CLOCK: [2016-12-10 Sat 12:27]--[2016-12-10 Sat 12:39] =>  0:12
   :END:
** DONE check whether pandoc fetches things concurrently
   CLOSED: [2016-12-12 Mon 12:50]
   :LOGBOOK:
   CLOCK: [2016-12-12 Mon 12:40]--[2016-12-12 Mon 12:50] =>  0:10
   :END:
** DONE Implement custom templates
   CLOSED: [2016-12-13 Tue 20:58]
   :LOGBOOK:
   CLOCK: [2016-12-13 Tue 20:27]--[2016-12-13 Tue 20:58] =>  0:31
   CLOCK: [2016-12-10 Sat 12:39]--[2016-12-10 Sat 13:29] =>  0:50
   :END:
** DONE Figure placement discussion
   CLOSED: [2016-12-14 Wed 14:34]
   :LOGBOOK:
   CLOCK: [2016-12-14 Wed 14:24]--[2016-12-14 Wed 14:34] =>  0:10
   :END:
** DONE settle on the exact names for the options (and make sure they're correct in the repo)
   CLOSED: [2016-12-15 Thu 23:38]
** DONE Test using the options
   CLOSED: [2016-12-16 Fri 00:00]
   :LOGBOOK:
   CLOCK: [2016-12-15 Thu 23:35]--[2016-12-16 Fri 00:00] =>  0:25
   :END:
** DONE Add another option
   CLOSED: [2016-12-20 Tue 13:38]
   :LOGBOOK:
   CLOCK: [2016-12-20 Tue 12:55]--[2016-12-20 Tue 13:38] =>  0:43
   :END:
** DONE for a response about the templates
   CLOSED: [2016-12-20 Tue 16:36]
** DONE implement literal templates
   CLOSED: [2016-12-20 Tue 17:10]
   :LOGBOOK:
   CLOCK: [2016-12-20 Tue 16:36]--[2016-12-20 Tue 17:10] =>  0:34
   :END:
** CANCELLED for a repsonse about the json format
   CLOSED: [2016-12-25 Sun 15:36]
** DONE send corilla my invoice.
   CLOSED: [2017-01-07 Sat 10:23]
** DONE Send a reminder about the invoice
   CLOSED: [2017-01-09 Mon 00:26] SCHEDULED: <2017-01-09 Mon>
** DONE for corilla to pay my invoice
   CLOSED: [2017-01-17 Tue 17:25]
** DONE Make named templates possible
   CLOSED: [2017-01-17 Tue 18:48]
   :LOGBOOK:
   CLOCK: [2017-01-17 Tue 18:48]--[2017-01-17 Tue 18:50] =>  0:02
   CLOCK: [2017-01-17 Tue 17:25]--[2017-01-17 Tue 18:48] =>  1:23
   CLOCK: [2017-01-17 Tue 17:20]--[2017-01-17 Tue 17:25] =>  0:05
   :END:
** DONE do th invoice processing with hledger
   CLOSED: [2017-01-17 Tue 19:04]
   :LOGBOOK:
   CLOCK: [2017-01-17 Tue 18:50]--[2017-01-17 Tue 19:04] =>  0:14
   :END:
** DONE Make a deployment script
   CLOSED: [2017-01-18 Wed 10:49]
   :LOGBOOK:
   CLOCK: [2017-01-18 Wed 10:41]--[2017-01-18 Wed 10:51] =>  0:10
   CLOCK: [2017-01-18 Wed 09:08]--[2017-01-18 Wed 10:34] =>  1:26
   :END:
** DONE Make a 'to json' converter.
   CLOSED: [2017-01-18 Wed 10:41]
   :LOGBOOK:
   CLOCK: [2017-01-18 Wed 10:34]--[2017-01-18 Wed 10:41] =>  0:07
   :END:
** DONE Make error message when latex is not installed nicer.
   CLOSED: [2017-01-18 Wed 12:52]
   :LOGBOOK:
   CLOCK: [2017-01-18 Wed 11:46]--[2017-01-18 Wed 12:52] =>  1:06
   :END:
** DONE Allow specification of port
   CLOSED: [2017-01-18 Wed 13:00]
   :LOGBOOK:
   CLOCK: [2017-01-18 Wed 12:52]--[2017-01-18 Wed 13:00] =>  0:08
   :END:
** DONE allow specification of data dir.
   CLOSED: [2017-01-18 Wed 13:09]
   :LOGBOOK:
   CLOCK: [2017-01-18 Wed 13:00]--[2017-01-18 Wed 13:10] =>  0:09
   :END:
** DONE Slack convos
   CLOSED: [2017-01-23 Mon 23:59]
   :LOGBOOK:
   CLOCK: [2017-01-23 Mon 21:54]--[2017-01-23 Mon 22:54] =>  0:00
   :END:
** DONE for the sync on monday.
   CLOSED: [2017-01-23 Mon 16:44]
   :LOGBOOK:
   CLOCK: [2017-01-23 Mon 16:00]--[2017-01-23 Mon 16:45] =>  0:45
   :END:
** DONE get ready to open source the service
   CLOSED: [2017-01-23 Mon 21:47]
   :LOGBOOK:
   CLOCK: [2017-01-23 Mon 20:19]--[2017-01-23 Mon 21:47] =>  1:28
   CLOCK: [2017-01-23 Mon 18:18]--[2017-01-23 Mon 18:39] =>  0:21
   :END:
** DONE Start reading the CodeDeploy docs
   CLOSED: [2017-01-24 Tue 16:03]
   :LOGBOOK:
   CLOCK: [2017-01-24 Tue 14:59]--[2017-01-24 Tue 16:03] =>  1:04
   :END:
** CANCELLED Get a simple script running
   CLOSED: [2017-01-24 Tue 20:06]
   :LOGBOOK:
   CLOCK: [2017-01-24 Tue 17:24]--[2017-01-24 Tue 20:06] =>  2:42
   CLOCK: [2017-01-24 Tue 16:03]--[2017-01-24 Tue 16:36] =>  0:33
   :END:
** DONE get a simple deployment done
   CLOSED: [2017-01-25 Wed 11:46]
   :LOGBOOK:
   CLOCK: [2017-01-25 Wed 11:09]--[2017-01-25 Wed 11:46] =>  0:37
   :END:
** DONE Get the pandoc service to run here.
   CLOSED: [2017-01-25 Wed 18:37]
   :LOGBOOK:
   CLOCK: [2017-01-25 Wed 18:11]--[2017-01-25 Wed 18:37] =>  0:26
   CLOCK: [2017-01-25 Wed 11:46]--[2017-01-25 Wed 13:06] =>  1:20
   :END:
** DONE Make a deploy-pandoc skeleton
   CLOSED: [2017-01-26 Thu 02:27]
   :LOGBOOK:
   CLOCK: [2017-01-26 Thu 00:30]--[2017-01-26 Thu 02:30] =>  2:00
   CLOCK: [2017-01-25 Wed 18:37]--[2017-01-25 Thu 18:50] =>  0:13
   :END:
** DONE make deploy-pandoc create-revision
   CLOSED: [2017-01-26 Thu 02:27]
** DONE make deploy-pandoc create-deployment
   CLOSED: [2017-01-26 Thu 02:27]
** DONE make deploy-pandoc deploy
   CLOSED: [2017-01-26 Thu 02:27]
** DONE make corilla-pandoc configurable
   CLOSED: [2017-01-26 Thu 14:28]
   :LOGBOOK:
   CLOCK: [2017-01-26 Thu 11:40]--[2017-01-26 Thu 14:28] =>  2:48
   :END:
** DONE make the deployment names configurable
   CLOSED: [2017-01-26 Thu 16:18]
   :LOGBOOK:
   CLOCK: [2017-01-26 Thu 15:53]--[2017-01-26 Thu 16:18] =>  0:25
   :END:
** DONE figure out how to install latex on aws.
   CLOSED: [2017-01-26 Thu 18:39]
   :LOGBOOK:
   CLOCK: [2017-01-26 Thu 16:18]--[2017-01-26 Thu 18:39] =>  2:21
   :END:
** DONE Make and chase after the invoice
   CLOSED: [2017-01-26 Thu 19:39]
   :LOGBOOK:
   CLOCK: [2017-01-26 Thu 18:39]--[2017-01-26 Thu 19:39] =>  1:00
   :END:
** DONE get the invoice in order
   CLOSED: [2017-01-29 Sun 01:35]
   :LOGBOOK:
   CLOCK: [2017-01-29 Sun 01:35]--[2017-01-29 Sun 01:35] =>  1:00
   :END:
** DONE read the amazonka docs to see if I should use that.
   CLOSED: [2017-03-20 Mon 22:00]
   :LOGBOOK:
   CLOCK: [2017-03-20 Mon 20:51]--[2017-03-20 Mon 22:00] =>  1:09
   :END:
** WAITING for a response from Nathan. I'm waiting for him to try out what I made
   - State "WAITING"    from "TODO"       [2017-01-27 Thu 18:47]
** TODO use the aws library to create everything that's necessary to run:
- An aws S3 bucket
- TODO what else

** TODO Start using api calls instead of the aws client.
